MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA606/mcu.h
/* ANSE */
#define _ANSE4 ANSEbits.ANSE4
#define _ANSELE4 ANSEbits.ANSELE4

/* IOCPE */
/* Bitname _IOCPE0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE4 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE5 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE6 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE7 cannot be defined because it is used by more than one SFR */

/* IOCNE */
#define _IOCNE0 IOCNEbits.IOCNE0
#define _IOCNE1 IOCNEbits.IOCNE1
#define _IOCNE2 IOCNEbits.IOCNE2
#define _IOCNE3 IOCNEbits.IOCNE3
#define _IOCNE4 IOCNEbits.IOCNE4
#define _IOCNE5 IOCNEbits.IOCNE5
#define _IOCNE6 IOCNEbits.IOCNE6
#define _IOCNE7 IOCNEbits.IOCNE7

/* IOCFE */
#define _IOCFE0 IOCFEbits.IOCFE0
#define _IOCFE1 IOCFEbits.IOCFE1
#define _IOCFE2 IOCFEbits.IOCFE2
#define _IOCFE3 IOCFEbits.IOCFE3
#define _IOCFE4 IOCFEbits.IOCFE4
#define _IOCFE5 IOCFEbits.IOCFE5
#define _IOCFE6 IOCFEbits.IOCFE6
#define _IOCFE7 IOCFEbits.IOCFE7

/* CNPUE */
/* Bitname _IOCPE0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE4 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE5 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE6 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE7 cannot be defined because it is used by more than one SFR */
#define _IOCPUE0 CNPUEbits.IOCPUE0
#define _IOCPUE1 CNPUEbits.IOCPUE1
#define _IOCPUE2 CNPUEbits.IOCPUE2
#define _IOCPUE3 CNPUEbits.IOCPUE3
#define _IOCPUE4 CNPUEbits.IOCPUE4
#define _IOCPUE5 CNPUEbits.IOCPUE5
#define _IOCPUE6 CNPUEbits.IOCPUE6
#define _IOCPUE7 CNPUEbits.IOCPUE7
#define _CNPUE0 CNPUEbits.CNPUE0
#define _CNPUE1 CNPUEbits.CNPUE1
#define _CNPUE2 CNPUEbits.CNPUE2
#define _CNPUE3 CNPUEbits.CNPUE3
#define _CNPUE4 CNPUEbits.CNPUE4
#define _CNPUE5 CNPUEbits.CNPUE5
#define _CNPUE6 CNPUEbits.CNPUE6
#define _CNPUE7 CNPUEbits.CNPUE7

/* CNPDE */
#define _IOCPDE0 CNPDEbits.IOCPDE0
#define _IOCPDE1 CNPDEbits.IOCPDE1
#define _IOCPDE2 CNPDEbits.IOCPDE2
#define _IOCPDE3 CNPDEbits.IOCPDE3
#define _IOCPDE4 CNPDEbits.IOCPDE4
#define _IOCPDE5 CNPDEbits.IOCPDE5
#define _IOCPDE6 CNPDEbits.IOCPDE6
#define _IOCPDE7 CNPDEbits.IOCPDE7
#define _CNPDE0 CNPDEbits.CNPDE0
#define _CNPDE1 CNPDEbits.CNPDE1
#define _CNPDE2 CNPDEbits.CNPDE2
#define _CNPDE3 CNPDEbits.CNPDE3
#define _CNPDE4 CNPDEbits.CNPDE4
#define _CNPDE5 CNPDEbits.CNPDE5
#define _CNPDE6 CNPDEbits.CNPDE6
#define _CNPDE7 CNPDEbits.CNPDE7

/* TRISF */
#define _TRISF0 TRISFbits.TRISF0
#define _TRISF1 TRISFbits.TRISF1
#define _TRISF2 TRISFbits.TRISF2
#define _TRISF3 TRISFbits.TRISF3
#define _TRISF4 TRISFbits.TRISF4
#define _TRISF5 TRISFbits.TRISF5
#define _TRISF6 TRISFbits.TRISF6

/* PORTF */
#define _RF0 PORTFbits.RF0
#define _RF1 PORTFbits.RF1
#define _RF2 PORTFbits.RF2
#define _RF3 PORTFbits.RF3
#define _RF4 PORTFbits.RF4
#define _RF5 PORTFbits.RF5
#define _RF6 PORTFbits.RF6

/* LATF */
#define _LATF0 LATFbits.LATF0
#define _LATF1 LATFbits.LATF1
#define _LATF2 LATFbits.LATF2
#define _LATF3 LATFbits.LATF3
#define _LATF4 LATFbits.LATF4
#define _LATF5 LATFbits.LATF5
#define _LATF6 LATFbits.LATF6

/* ODCF */
#define _ODCF0 ODCFbits.ODCF0
#define _ODCF1 ODCFbits.ODCF1
#define _ODCF2 ODCFbits.ODCF2
#define _ODCF3 ODCFbits.ODCF3
#define _ODCF4 ODCFbits.ODCF4
#define _ODCF5 ODCFbits.ODCF5
#define _ODCF6 ODCFbits.ODCF6

/* IOCPF */
/* Bitname _IOCPF0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF4 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF5 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF6 cannot be defined because it is used by more than one SFR */

/* IOCNF */
#define _IOCNF0 IOCNFbits.IOCNF0
#define _IOCNF1 IOCNFbits.IOCNF1
#define _IOCNF2 IOCNFbits.IOCNF2
#define _IOCNF3 IOCNFbits.IOCNF3
#define _IOCNF4 IOCNFbits.IOCNF4
#define _IOCNF5 IOCNFbits.IOCNF5
#define _IOCNF6 IOCNFbits.IOCNF6

/* IOCFF */
#define _IOCFF0 IOCFFbits.IOCFF0
#define _IOCFF1 IOCFFbits.IOCFF1
#define _IOCFF2 IOCFFbits.IOCFF2
#define _IOCFF3 IOCFFbits.IOCFF3
#define _IOCFF4 IOCFFbits.IOCFF4
#define _IOCFF5 IOCFFbits.IOCFF5
#define _IOCFF6 IOCFFbits.IOCFF6

/* CNPUF */
/* Bitname _IOCPF0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF4 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF5 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF6 cannot be defined because it is used by more than one SFR */
#define _IOCPUF0 CNPUFbits.IOCPUF0
#define _IOCPUF1 CNPUFbits.IOCPUF1
#define _IOCPUF2 CNPUFbits.IOCPUF2
#define _IOCPUF3 CNPUFbits.IOCPUF3
#define _IOCPUF4 CNPUFbits.IOCPUF4
#define _IOCPUF5 CNPUFbits.IOCPUF5
#define _IOCPUF6 CNPUFbits.IOCPUF6
#define _CNPUF0 CNPUFbits.CNPUF0
#define _CNPUF1 CNPUFbits.CNPUF1
#define _CNPUF2 CNPUFbits.CNPUF2
#define _CNPUF3 CNPUFbits.CNPUF3
#define _CNPUF4 CNPUFbits.CNPUF4
#define _CNPUF5 CNPUFbits.CNPUF5
#define _CNPUF6 CNPUFbits.CNPUF6

/* CNPDF */
#define _IOCPDF0 CNPDFbits.IOCPDF0
#define _IOCPDF1 CNPDFbits.IOCPDF1
#define _IOCPDF2 CNPDFbits.IOCPDF2
#define _IOCPDF3 CNPDFbits.IOCPDF3
#define _IOCPDF4 CNPDFbits.IOCPDF4
#define _IOCPDF5 CNPDFbits.IOCPDF5
#define _IOCPDF6 CNPDFbits.IOCPDF6
#define _CNPDF0 CNPDFbits.CNPDF0
#define _CNPDF1 CNPDFbits.CNPDF1
#define _CNPDF2 CNPDFbits.CNPDF2
#define _CNPDF3 CNPDFbits.CNPDF3
#define _CNPDF4 CNPDFbits.CNPDF4
#define _CNPDF5 CNPDFbits.CNPDF5
#define _CNPDF6 CNPDFbits.CNPDF6

/* TRISG */
#define _TRISG2 TRISGbits.TRISG2
#define _TRISG3 TRISGbits.TRISG3
#define _TRISG6 TRISGbits.TRISG6
#define _TRISG7 TRISGbits.TRISG7
#define _TRISG8 TRISGbits.TRISG8
#define _TRISG9 TRISGbits.TRISG9

/* PORTG */
#define _RG2 PORTGbits.RG2
#define _RG3 PORTGbits.RG3
#define _RG6 PORTGbits.RG6
#define _RG7 PORTGbits.RG7
#define _RG8 PORTGbits.RG8
#define _RG9 PORTGbits.RG9

/* LATG */
#define _LATG2 LATGbits.LATG2
#define _LATG3 LATGbits.LATG3
#define _LATG6 LATGbits.LATG6
#define _LATG7 LATGbits.LATG7
#define _LATG8 LATGbits.LATG8
#define _LATG9 LATGbits.LATG9

/* ODCG */
#define _ODCG2 ODCGbits.ODCG2
#define _ODCG3 ODCGbits.ODCG3
#define _ODCG6 ODCGbits.ODCG6
#define _ODCG7 ODCGbits.ODCG7
#define _ODCG8 ODCGbits.ODCG8
#define _ODCG9 ODCGbits.ODCG9

/* ANSELG */
#define _ANSG6 ANSELGbits.ANSG6
#define _ANSG7 ANSELGbits.ANSG7
#define _ANSG8 ANSELGbits.ANSG8
#define _ANSG9 ANSELGbits.ANSG9
#define _ANSELG6 ANSELGbits.ANSELG6
#define _ANSELG7 ANSELGbits.ANSELG7
#define _ANSELG8 ANSELGbits.ANSELG8
#define _ANSELG9 ANSELGbits.ANSELG9

/* IOCPG */
/* Bitname _IOCPG2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPG3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPG6 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPG7 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPG8 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPG9 cannot be defined because it is used by more than one SFR */

/* IOCNG */
#define _IOCNG2 IOCNGbits.IOCNG2
#define _IOCNG3 IOCNGbits.IOCNG3
#define _IOCNG6 IOCNGbits.IOCNG6
#define _IOCNG7 IOCNGbits.IOCNG7
#define _IOCNG8 IOCNGbits.IOCNG8
#define _IOCNG9 IOCNGbits.IOCNG9

/* IOCFG */
#define _IOCFG2 IOCFGbits.IOCFG2
#define _IOCFG3 IOCFGbits.IOCFG3
#define _IOCFG6 IOCFGbits.IOCFG6
#define _IOCFG7 IOCFGbits.IOCFG7
#define _IOCFG8 IOCFGbits.IOCFG8
#define _IOCFG9 IOCFGbits.IOCFG9

