MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA606/mcu.h
#define _CCP6CON2H_ICSEL2_POSITION               0x00000002
#define _CCP6CON2H_ICSEL2_MASK                   0x00000004
#define _CCP6CON2H_ICSEL2_LENGTH                 0x00000001

#define _CCP6CON3H_PSSACE_POSITION               0x00000002
#define _CCP6CON3H_PSSACE_MASK                   0x0000000C
#define _CCP6CON3H_PSSACE_LENGTH                 0x00000002

#define _CCP6CON3H_POLACE_POSITION               0x00000005
#define _CCP6CON3H_POLACE_MASK                   0x00000020
#define _CCP6CON3H_POLACE_LENGTH                 0x00000001

#define _CCP6CON3H_OSCNT_POSITION                0x0000000C
#define _CCP6CON3H_OSCNT_MASK                    0x00007000
#define _CCP6CON3H_OSCNT_LENGTH                  0x00000003

#define _CCP6CON3H_OETRIG_POSITION               0x0000000F
#define _CCP6CON3H_OETRIG_MASK                   0x00008000
#define _CCP6CON3H_OETRIG_LENGTH                 0x00000001

#define _CCP6CON3H_PSSACE0_POSITION              0x00000002
#define _CCP6CON3H_PSSACE0_MASK                  0x00000004
#define _CCP6CON3H_PSSACE0_LENGTH                0x00000001

#define _CCP6CON3H_PSSACE1_POSITION              0x00000003
#define _CCP6CON3H_PSSACE1_MASK                  0x00000008
#define _CCP6CON3H_PSSACE1_LENGTH                0x00000001

#define _CCP6CON3H_OSCNT0_POSITION               0x0000000C
#define _CCP6CON3H_OSCNT0_MASK                   0x00001000
#define _CCP6CON3H_OSCNT0_LENGTH                 0x00000001

#define _CCP6CON3H_OSCNT1_POSITION               0x0000000D
#define _CCP6CON3H_OSCNT1_MASK                   0x00002000
#define _CCP6CON3H_OSCNT1_LENGTH                 0x00000001

#define _CCP6CON3H_OSCNT2_POSITION               0x0000000E
#define _CCP6CON3H_OSCNT2_MASK                   0x00004000
#define _CCP6CON3H_OSCNT2_LENGTH                 0x00000001

#define _CCP6STAT_ICBNE_POSITION                 0x00000000
#define _CCP6STAT_ICBNE_MASK                     0x00000001
#define _CCP6STAT_ICBNE_LENGTH                   0x00000001

#define _CCP6STAT_ICOV_POSITION                  0x00000001
#define _CCP6STAT_ICOV_MASK                      0x00000002
#define _CCP6STAT_ICOV_LENGTH                    0x00000001

#define _CCP6STAT_ICDIS_POSITION                 0x00000002
#define _CCP6STAT_ICDIS_MASK                     0x00000004
#define _CCP6STAT_ICDIS_LENGTH                   0x00000001

#define _CCP6STAT_SCEVT_POSITION                 0x00000003
#define _CCP6STAT_SCEVT_MASK                     0x00000008
#define _CCP6STAT_SCEVT_LENGTH                   0x00000001

#define _CCP6STAT_ASEVT_POSITION                 0x00000004
#define _CCP6STAT_ASEVT_MASK                     0x00000010
#define _CCP6STAT_ASEVT_LENGTH                   0x00000001

#define _CCP6STAT_TRCLR_POSITION                 0x00000005
#define _CCP6STAT_TRCLR_MASK                     0x00000020
#define _CCP6STAT_TRCLR_LENGTH                   0x00000001

#define _CCP6STAT_TRSET_POSITION                 0x00000006
#define _CCP6STAT_TRSET_MASK                     0x00000040
#define _CCP6STAT_TRSET_LENGTH                   0x00000001

#define _CCP6STAT_CCPTRIG_POSITION               0x00000007
#define _CCP6STAT_CCPTRIG_MASK                   0x00000080
#define _CCP6STAT_CCPTRIG_LENGTH                 0x00000001

#define _CCP6STAT_ICGARM_POSITION                0x0000000A
#define _CCP6STAT_ICGARM_MASK                    0x00000400
#define _CCP6STAT_ICGARM_LENGTH                  0x00000001

#define _CCP6STAT_TRIG_POSITION                  0x00000007
#define _CCP6STAT_TRIG_MASK                      0x00000080
#define _CCP6STAT_TRIG_LENGTH                    0x00000001

#define _CCP6STATL_ICBNE_POSITION                0x00000000
#define _CCP6STATL_ICBNE_MASK                    0x00000001
#define _CCP6STATL_ICBNE_LENGTH                  0x00000001

#define _CCP6STATL_ICOV_POSITION                 0x00000001
#define _CCP6STATL_ICOV_MASK                     0x00000002
#define _CCP6STATL_ICOV_LENGTH                   0x00000001

#define _CCP6STATL_ICDIS_POSITION                0x00000002
#define _CCP6STATL_ICDIS_MASK                    0x00000004
#define _CCP6STATL_ICDIS_LENGTH                  0x00000001

#define _CCP6STATL_SCEVT_POSITION                0x00000003
#define _CCP6STATL_SCEVT_MASK                    0x00000008
#define _CCP6STATL_SCEVT_LENGTH                  0x00000001

#define _CCP6STATL_ASEVT_POSITION                0x00000004
#define _CCP6STATL_ASEVT_MASK                    0x00000010
#define _CCP6STATL_ASEVT_LENGTH                  0x00000001

#define _CCP6STATL_TRCLR_POSITION                0x00000005
#define _CCP6STATL_TRCLR_MASK                    0x00000020
#define _CCP6STATL_TRCLR_LENGTH                  0x00000001

#define _CCP6STATL_TRSET_POSITION                0x00000006
#define _CCP6STATL_TRSET_MASK                    0x00000040
#define _CCP6STATL_TRSET_LENGTH                  0x00000001

#define _CCP6STATL_CCPTRIG_POSITION              0x00000007
#define _CCP6STATL_CCPTRIG_MASK                  0x00000080
#define _CCP6STATL_CCPTRIG_LENGTH                0x00000001

#define _CCP6STATL_ICGARM_POSITION               0x0000000A
#define _CCP6STATL_ICGARM_MASK                   0x00000400
#define _CCP6STATL_ICGARM_LENGTH                 0x00000001

#define _CCP6STATL_TRIG_POSITION                 0x00000007
#define _CCP6STATL_TRIG_MASK                     0x00000080
#define _CCP6STATL_TRIG_LENGTH                   0x00000001

#define _CCP6STATH_RAWIP_POSITION                0x00000000
#define _CCP6STATH_RAWIP_MASK                    0x00000001
#define _CCP6STATH_RAWIP_LENGTH                  0x00000001

#define _CCP6STATH_RBWIP_POSITION                0x00000001
#define _CCP6STATH_RBWIP_MASK                    0x00000002
#define _CCP6STATH_RBWIP_LENGTH                  0x00000001

#define _CCP6STATH_TMRLWIP_POSITION              0x00000002
#define _CCP6STATH_TMRLWIP_MASK                  0x00000004
#define _CCP6STATH_TMRLWIP_LENGTH                0x00000001

#define _CCP6STATH_TMRHWIP_POSITION              0x00000003
#define _CCP6STATH_TMRHWIP_MASK                  0x00000008
#define _CCP6STATH_TMRHWIP_LENGTH                0x00000001

#define _CCP6STATH_PRLWIP_POSITION               0x00000004
#define _CCP6STATH_PRLWIP_MASK                   0x00000010
#define _CCP6STATH_PRLWIP_LENGTH                 0x00000001

#define _CCP7CON1L_MOD_POSITION                  0x00000000
#define _CCP7CON1L_MOD_MASK                      0x0000000F
#define _CCP7CON1L_MOD_LENGTH                    0x00000004

#define _CCP7CON1L_CCSEL_POSITION                0x00000004
#define _CCP7CON1L_CCSEL_MASK                    0x00000010
#define _CCP7CON1L_CCSEL_LENGTH                  0x00000001

