MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA606/mcu.h
#define _I2C3CONH_SBCDE_POSITION                 0x00000002
#define _I2C3CONH_SBCDE_MASK                     0x00000004
#define _I2C3CONH_SBCDE_LENGTH                   0x00000001

#define _I2C3CONH_SDAHT_POSITION                 0x00000003
#define _I2C3CONH_SDAHT_MASK                     0x00000008
#define _I2C3CONH_SDAHT_LENGTH                   0x00000001

#define _I2C3CONH_BOEN_POSITION                  0x00000004
#define _I2C3CONH_BOEN_MASK                      0x00000010
#define _I2C3CONH_BOEN_LENGTH                    0x00000001

#define _I2C3CONH_SCIE_POSITION                  0x00000005
#define _I2C3CONH_SCIE_MASK                      0x00000020
#define _I2C3CONH_SCIE_LENGTH                    0x00000001

#define _I2C3CONH_PCIE_POSITION                  0x00000006
#define _I2C3CONH_PCIE_MASK                      0x00000040
#define _I2C3CONH_PCIE_LENGTH                    0x00000001

#define _I2C3STAT_TBF_POSITION                   0x00000000
#define _I2C3STAT_TBF_MASK                       0x00000001
#define _I2C3STAT_TBF_LENGTH                     0x00000001

#define _I2C3STAT_RBF_POSITION                   0x00000001
#define _I2C3STAT_RBF_MASK                       0x00000002
#define _I2C3STAT_RBF_LENGTH                     0x00000001

#define _I2C3STAT_R_NOT_W_POSITION               0x00000002
#define _I2C3STAT_R_NOT_W_MASK                   0x00000004
#define _I2C3STAT_R_NOT_W_LENGTH                 0x00000001

#define _I2C3STAT_S_POSITION                     0x00000003
#define _I2C3STAT_S_MASK                         0x00000008
#define _I2C3STAT_S_LENGTH                       0x00000001

#define _I2C3STAT_P_POSITION                     0x00000004
#define _I2C3STAT_P_MASK                         0x00000010
#define _I2C3STAT_P_LENGTH                       0x00000001

#define _I2C3STAT_D_NOT_A_POSITION               0x00000005
#define _I2C3STAT_D_NOT_A_MASK                   0x00000020
#define _I2C3STAT_D_NOT_A_LENGTH                 0x00000001

#define _I2C3STAT_I2COV_POSITION                 0x00000006
#define _I2C3STAT_I2COV_MASK                     0x00000040
#define _I2C3STAT_I2COV_LENGTH                   0x00000001

#define _I2C3STAT_IWCOL_POSITION                 0x00000007
#define _I2C3STAT_IWCOL_MASK                     0x00000080
#define _I2C3STAT_IWCOL_LENGTH                   0x00000001

#define _I2C3STAT_ADD10_POSITION                 0x00000008
#define _I2C3STAT_ADD10_MASK                     0x00000100
#define _I2C3STAT_ADD10_LENGTH                   0x00000001

#define _I2C3STAT_GCSTAT_POSITION                0x00000009
#define _I2C3STAT_GCSTAT_MASK                    0x00000200
#define _I2C3STAT_GCSTAT_LENGTH                  0x00000001

#define _I2C3STAT_BCL_POSITION                   0x0000000A
#define _I2C3STAT_BCL_MASK                       0x00000400
#define _I2C3STAT_BCL_LENGTH                     0x00000001

#define _I2C3STAT_ACKTIM_POSITION                0x0000000D
#define _I2C3STAT_ACKTIM_MASK                    0x00002000
#define _I2C3STAT_ACKTIM_LENGTH                  0x00000001

#define _I2C3STAT_TRSTAT_POSITION                0x0000000E
#define _I2C3STAT_TRSTAT_MASK                    0x00004000
#define _I2C3STAT_TRSTAT_LENGTH                  0x00000001

#define _I2C3STAT_ACKSTAT_POSITION               0x0000000F
#define _I2C3STAT_ACKSTAT_MASK                   0x00008000
#define _I2C3STAT_ACKSTAT_LENGTH                 0x00000001

#define _I2C3STAT_R_W_POSITION                   0x00000002
#define _I2C3STAT_R_W_MASK                       0x00000004
#define _I2C3STAT_R_W_LENGTH                     0x00000001

#define _I2C3STAT_D_A_POSITION                   0x00000005
#define _I2C3STAT_D_A_MASK                       0x00000020
#define _I2C3STAT_D_A_LENGTH                     0x00000001

#define _I2C3STAT_RW_POSITION                    0x00000002
#define _I2C3STAT_RW_MASK                        0x00000004
#define _I2C3STAT_RW_LENGTH                      0x00000001

#define _I2C3STAT_DA_POSITION                    0x00000005
#define _I2C3STAT_DA_MASK                        0x00000020
#define _I2C3STAT_DA_LENGTH                      0x00000001

#define _I2C3ADD_ADD_POSITION                    0x00000000
#define _I2C3ADD_ADD_MASK                        0x000003FF
#define _I2C3ADD_ADD_LENGTH                      0x0000000A

#define _I2C3MSK_MSK_POSITION                    0x00000000
#define _I2C3MSK_MSK_MASK                        0x000003FF
#define _I2C3MSK_MSK_LENGTH                      0x0000000A

#define _I2C3MSK_AMSK_POSITION                   0x00000000
#define _I2C3MSK_AMSK_MASK                       0x000003FF
#define _I2C3MSK_AMSK_LENGTH                     0x0000000A

#define _DMACON_PRSSEL_POSITION                  0x00000000
#define _DMACON_PRSSEL_MASK                      0x00000001
#define _DMACON_PRSSEL_LENGTH                    0x00000001

#define _DMACON_DMASIDL_POSITION                 0x0000000D
#define _DMACON_DMASIDL_MASK                     0x00002000
#define _DMACON_DMASIDL_LENGTH                   0x00000001

#define _DMACON_DMAEN_POSITION                   0x0000000F
#define _DMACON_DMAEN_MASK                       0x00008000
#define _DMACON_DMAEN_LENGTH                     0x00000001

#define _DMACH0_CHEN_POSITION                    0x00000000
#define _DMACH0_CHEN_MASK                        0x00000001
#define _DMACH0_CHEN_LENGTH                      0x00000001

#define _DMACH0_SIZE_POSITION                    0x00000001
#define _DMACH0_SIZE_MASK                        0x00000002
#define _DMACH0_SIZE_LENGTH                      0x00000001

#define _DMACH0_TRMODE_POSITION                  0x00000002
#define _DMACH0_TRMODE_MASK                      0x0000000C
#define _DMACH0_TRMODE_LENGTH                    0x00000002

#define _DMACH0_DAMODE_POSITION                  0x00000004
#define _DMACH0_DAMODE_MASK                      0x00000030
#define _DMACH0_DAMODE_LENGTH                    0x00000002

#define _DMACH0_SAMODE_POSITION                  0x00000006
#define _DMACH0_SAMODE_MASK                      0x000000C0
#define _DMACH0_SAMODE_LENGTH                    0x00000002

#define _DMACH0_CHREQ_POSITION                   0x00000008
#define _DMACH0_CHREQ_MASK                       0x00000100
#define _DMACH0_CHREQ_LENGTH                     0x00000001

#define _DMACH0_RELOAD_POSITION                  0x00000009
#define _DMACH0_RELOAD_MASK                      0x00000200
#define _DMACH0_RELOAD_LENGTH                    0x00000001

#define _DMACH0_NULLW_POSITION                   0x0000000A
#define _DMACH0_NULLW_MASK                       0x00000400
#define _DMACH0_NULLW_LENGTH                     0x00000001

