MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA606/mcu.h
#define _DMAINT7_CHSEL0_POSITION                 0x00000008
#define _DMAINT7_CHSEL0_MASK                     0x00000100
#define _DMAINT7_CHSEL0_LENGTH                   0x00000001

#define _DMAINT7_CHSEL1_POSITION                 0x00000009
#define _DMAINT7_CHSEL1_MASK                     0x00000200
#define _DMAINT7_CHSEL1_LENGTH                   0x00000001

#define _DMAINT7_CHSEL2_POSITION                 0x0000000A
#define _DMAINT7_CHSEL2_MASK                     0x00000400
#define _DMAINT7_CHSEL2_LENGTH                   0x00000001

#define _DMAINT7_CHSEL3_POSITION                 0x0000000B
#define _DMAINT7_CHSEL3_MASK                     0x00000800
#define _DMAINT7_CHSEL3_LENGTH                   0x00000001

#define _DMAINT7_CHSEL4_POSITION                 0x0000000C
#define _DMAINT7_CHSEL4_MASK                     0x00001000
#define _DMAINT7_CHSEL4_LENGTH                   0x00000001

#define _DMAINT7_CHSEL5_POSITION                 0x0000000D
#define _DMAINT7_CHSEL5_MASK                     0x00002000
#define _DMAINT7_CHSEL5_LENGTH                   0x00000001

#define _DMAINT7_CHSEL6_POSITION                 0x0000000E
#define _DMAINT7_CHSEL6_MASK                     0x00004000
#define _DMAINT7_CHSEL6_LENGTH                   0x00000001

#define _PADCON_PMPTTL_POSITION                  0x00000000
#define _PADCON_PMPTTL_MASK                      0x00000001
#define _PADCON_PMPTTL_LENGTH                    0x00000001

#define _PADCON_IOCON_POSITION                   0x0000000F
#define _PADCON_IOCON_MASK                       0x00008000
#define _PADCON_IOCON_LENGTH                     0x00000001

#define _IOCSTAT_IOCPBF_POSITION                 0x00000001
#define _IOCSTAT_IOCPBF_MASK                     0x00000002
#define _IOCSTAT_IOCPBF_LENGTH                   0x00000001

#define _IOCSTAT_IOCPCF_POSITION                 0x00000002
#define _IOCSTAT_IOCPCF_MASK                     0x00000004
#define _IOCSTAT_IOCPCF_LENGTH                   0x00000001

#define _IOCSTAT_IOCPDF_POSITION                 0x00000003
#define _IOCSTAT_IOCPDF_MASK                     0x00000008
#define _IOCSTAT_IOCPDF_LENGTH                   0x00000001

#define _IOCSTAT_IOCPEF_POSITION                 0x00000004
#define _IOCSTAT_IOCPEF_MASK                     0x00000010
#define _IOCSTAT_IOCPEF_LENGTH                   0x00000001

#define _IOCSTAT_IOCPFF_POSITION                 0x00000005
#define _IOCSTAT_IOCPFF_MASK                     0x00000020
#define _IOCSTAT_IOCPFF_LENGTH                   0x00000001

#define _IOCSTAT_IOCPGF_POSITION                 0x00000006
#define _IOCSTAT_IOCPGF_MASK                     0x00000040
#define _IOCSTAT_IOCPGF_LENGTH                   0x00000001

#define _TRISB_TRISB0_POSITION                   0x00000000
#define _TRISB_TRISB0_MASK                       0x00000001
#define _TRISB_TRISB0_LENGTH                     0x00000001

#define _TRISB_TRISB1_POSITION                   0x00000001
#define _TRISB_TRISB1_MASK                       0x00000002
#define _TRISB_TRISB1_LENGTH                     0x00000001

#define _TRISB_TRISB2_POSITION                   0x00000002
#define _TRISB_TRISB2_MASK                       0x00000004
#define _TRISB_TRISB2_LENGTH                     0x00000001

#define _TRISB_TRISB3_POSITION                   0x00000003
#define _TRISB_TRISB3_MASK                       0x00000008
#define _TRISB_TRISB3_LENGTH                     0x00000001

#define _TRISB_TRISB4_POSITION                   0x00000004
#define _TRISB_TRISB4_MASK                       0x00000010
#define _TRISB_TRISB4_LENGTH                     0x00000001

#define _TRISB_TRISB5_POSITION                   0x00000005
#define _TRISB_TRISB5_MASK                       0x00000020
#define _TRISB_TRISB5_LENGTH                     0x00000001

#define _TRISB_TRISB6_POSITION                   0x00000006
#define _TRISB_TRISB6_MASK                       0x00000040
#define _TRISB_TRISB6_LENGTH                     0x00000001

#define _TRISB_TRISB7_POSITION                   0x00000007
#define _TRISB_TRISB7_MASK                       0x00000080
#define _TRISB_TRISB7_LENGTH                     0x00000001

#define _TRISB_TRISB8_POSITION                   0x00000008
#define _TRISB_TRISB8_MASK                       0x00000100
#define _TRISB_TRISB8_LENGTH                     0x00000001

#define _TRISB_TRISB9_POSITION                   0x00000009
#define _TRISB_TRISB9_MASK                       0x00000200
#define _TRISB_TRISB9_LENGTH                     0x00000001

#define _TRISB_TRISB10_POSITION                  0x0000000A
#define _TRISB_TRISB10_MASK                      0x00000400
#define _TRISB_TRISB10_LENGTH                    0x00000001

#define _TRISB_TRISB11_POSITION                  0x0000000B
#define _TRISB_TRISB11_MASK                      0x00000800
#define _TRISB_TRISB11_LENGTH                    0x00000001

#define _TRISB_TRISB12_POSITION                  0x0000000C
#define _TRISB_TRISB12_MASK                      0x00001000
#define _TRISB_TRISB12_LENGTH                    0x00000001

#define _TRISB_TRISB13_POSITION                  0x0000000D
#define _TRISB_TRISB13_MASK                      0x00002000
#define _TRISB_TRISB13_LENGTH                    0x00000001

#define _TRISB_TRISB14_POSITION                  0x0000000E
#define _TRISB_TRISB14_MASK                      0x00004000
#define _TRISB_TRISB14_LENGTH                    0x00000001

#define _TRISB_TRISB15_POSITION                  0x0000000F
#define _TRISB_TRISB15_MASK                      0x00008000
#define _TRISB_TRISB15_LENGTH                    0x00000001

#define _PORTB_RB0_POSITION                      0x00000000
#define _PORTB_RB0_MASK                          0x00000001
#define _PORTB_RB0_LENGTH                        0x00000001

#define _PORTB_RB1_POSITION                      0x00000001
#define _PORTB_RB1_MASK                          0x00000002
#define _PORTB_RB1_LENGTH                        0x00000001

#define _PORTB_RB2_POSITION                      0x00000002
#define _PORTB_RB2_MASK                          0x00000004
#define _PORTB_RB2_LENGTH                        0x00000001

#define _PORTB_RB3_POSITION                      0x00000003
#define _PORTB_RB3_MASK                          0x00000008
#define _PORTB_RB3_LENGTH                        0x00000001

#define _PORTB_RB4_POSITION                      0x00000004
#define _PORTB_RB4_MASK                          0x00000010
#define _PORTB_RB4_LENGTH                        0x00000001

#define _PORTB_RB5_POSITION                      0x00000005
#define _PORTB_RB5_MASK                          0x00000020
#define _PORTB_RB5_LENGTH                        0x00000001

