MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA606/mcu.h
#define _IOCPB_IOCPB5_POSITION                   0x00000005
#define _IOCPB_IOCPB5_MASK                       0x00000020
#define _IOCPB_IOCPB5_LENGTH                     0x00000001

#define _IOCPB_IOCPB6_POSITION                   0x00000006
#define _IOCPB_IOCPB6_MASK                       0x00000040
#define _IOCPB_IOCPB6_LENGTH                     0x00000001

#define _IOCPB_IOCPB7_POSITION                   0x00000007
#define _IOCPB_IOCPB7_MASK                       0x00000080
#define _IOCPB_IOCPB7_LENGTH                     0x00000001

#define _IOCPB_IOCPB8_POSITION                   0x00000008
#define _IOCPB_IOCPB8_MASK                       0x00000100
#define _IOCPB_IOCPB8_LENGTH                     0x00000001

#define _IOCPB_IOCPB9_POSITION                   0x00000009
#define _IOCPB_IOCPB9_MASK                       0x00000200
#define _IOCPB_IOCPB9_LENGTH                     0x00000001

#define _IOCPB_IOCPB10_POSITION                  0x0000000A
#define _IOCPB_IOCPB10_MASK                      0x00000400
#define _IOCPB_IOCPB10_LENGTH                    0x00000001

#define _IOCPB_IOCPB11_POSITION                  0x0000000B
#define _IOCPB_IOCPB11_MASK                      0x00000800
#define _IOCPB_IOCPB11_LENGTH                    0x00000001

#define _IOCPB_IOCPB12_POSITION                  0x0000000C
#define _IOCPB_IOCPB12_MASK                      0x00001000
#define _IOCPB_IOCPB12_LENGTH                    0x00000001

#define _IOCPB_IOCPB13_POSITION                  0x0000000D
#define _IOCPB_IOCPB13_MASK                      0x00002000
#define _IOCPB_IOCPB13_LENGTH                    0x00000001

#define _IOCPB_IOCPB14_POSITION                  0x0000000E
#define _IOCPB_IOCPB14_MASK                      0x00004000
#define _IOCPB_IOCPB14_LENGTH                    0x00000001

#define _IOCPB_IOCPB15_POSITION                  0x0000000F
#define _IOCPB_IOCPB15_MASK                      0x00008000
#define _IOCPB_IOCPB15_LENGTH                    0x00000001

#define _IOCNB_IOCNB0_POSITION                   0x00000000
#define _IOCNB_IOCNB0_MASK                       0x00000001
#define _IOCNB_IOCNB0_LENGTH                     0x00000001

#define _IOCNB_IOCNB1_POSITION                   0x00000001
#define _IOCNB_IOCNB1_MASK                       0x00000002
#define _IOCNB_IOCNB1_LENGTH                     0x00000001

#define _IOCNB_IOCNB2_POSITION                   0x00000002
#define _IOCNB_IOCNB2_MASK                       0x00000004
#define _IOCNB_IOCNB2_LENGTH                     0x00000001

#define _IOCNB_IOCNB3_POSITION                   0x00000003
#define _IOCNB_IOCNB3_MASK                       0x00000008
#define _IOCNB_IOCNB3_LENGTH                     0x00000001

#define _IOCNB_IOCNB4_POSITION                   0x00000004
#define _IOCNB_IOCNB4_MASK                       0x00000010
#define _IOCNB_IOCNB4_LENGTH                     0x00000001

#define _IOCNB_IOCNB5_POSITION                   0x00000005
#define _IOCNB_IOCNB5_MASK                       0x00000020
#define _IOCNB_IOCNB5_LENGTH                     0x00000001

#define _IOCNB_IOCNB6_POSITION                   0x00000006
#define _IOCNB_IOCNB6_MASK                       0x00000040
#define _IOCNB_IOCNB6_LENGTH                     0x00000001

#define _IOCNB_IOCNB7_POSITION                   0x00000007
#define _IOCNB_IOCNB7_MASK                       0x00000080
#define _IOCNB_IOCNB7_LENGTH                     0x00000001

#define _IOCNB_IOCNB8_POSITION                   0x00000008
#define _IOCNB_IOCNB8_MASK                       0x00000100
#define _IOCNB_IOCNB8_LENGTH                     0x00000001

#define _IOCNB_IOCNB9_POSITION                   0x00000009
#define _IOCNB_IOCNB9_MASK                       0x00000200
#define _IOCNB_IOCNB9_LENGTH                     0x00000001

#define _IOCNB_IOCNB10_POSITION                  0x0000000A
#define _IOCNB_IOCNB10_MASK                      0x00000400
#define _IOCNB_IOCNB10_LENGTH                    0x00000001

#define _IOCNB_IOCNB11_POSITION                  0x0000000B
#define _IOCNB_IOCNB11_MASK                      0x00000800
#define _IOCNB_IOCNB11_LENGTH                    0x00000001

#define _IOCNB_IOCNB12_POSITION                  0x0000000C
#define _IOCNB_IOCNB12_MASK                      0x00001000
#define _IOCNB_IOCNB12_LENGTH                    0x00000001

#define _IOCNB_IOCNB13_POSITION                  0x0000000D
#define _IOCNB_IOCNB13_MASK                      0x00002000
#define _IOCNB_IOCNB13_LENGTH                    0x00000001

#define _IOCNB_IOCNB14_POSITION                  0x0000000E
#define _IOCNB_IOCNB14_MASK                      0x00004000
#define _IOCNB_IOCNB14_LENGTH                    0x00000001

#define _IOCNB_IOCNB15_POSITION                  0x0000000F
#define _IOCNB_IOCNB15_MASK                      0x00008000
#define _IOCNB_IOCNB15_LENGTH                    0x00000001

#define _IOCFB_IOCFB0_POSITION                   0x00000000
#define _IOCFB_IOCFB0_MASK                       0x00000001
#define _IOCFB_IOCFB0_LENGTH                     0x00000001

#define _IOCFB_IOCFB1_POSITION                   0x00000001
#define _IOCFB_IOCFB1_MASK                       0x00000002
#define _IOCFB_IOCFB1_LENGTH                     0x00000001

#define _IOCFB_IOCFB2_POSITION                   0x00000002
#define _IOCFB_IOCFB2_MASK                       0x00000004
#define _IOCFB_IOCFB2_LENGTH                     0x00000001

#define _IOCFB_IOCFB3_POSITION                   0x00000003
#define _IOCFB_IOCFB3_MASK                       0x00000008
#define _IOCFB_IOCFB3_LENGTH                     0x00000001

#define _IOCFB_IOCFB4_POSITION                   0x00000004
#define _IOCFB_IOCFB4_MASK                       0x00000010
#define _IOCFB_IOCFB4_LENGTH                     0x00000001

#define _IOCFB_IOCFB5_POSITION                   0x00000005
#define _IOCFB_IOCFB5_MASK                       0x00000020
#define _IOCFB_IOCFB5_LENGTH                     0x00000001

#define _IOCFB_IOCFB6_POSITION                   0x00000006
#define _IOCFB_IOCFB6_MASK                       0x00000040
#define _IOCFB_IOCFB6_LENGTH                     0x00000001

#define _IOCFB_IOCFB7_POSITION                   0x00000007
#define _IOCFB_IOCFB7_MASK                       0x00000080
#define _IOCFB_IOCFB7_LENGTH                     0x00000001

#define _IOCFB_IOCFB8_POSITION                   0x00000008
#define _IOCFB_IOCFB8_MASK                       0x00000100
#define _IOCFB_IOCFB8_LENGTH                     0x00000001

#define _IOCFB_IOCFB9_POSITION                   0x00000009
#define _IOCFB_IOCFB9_MASK                       0x00000200
#define _IOCFB_IOCFB9_LENGTH                     0x00000001

#define _IOCFB_IOCFB10_POSITION                  0x0000000A
#define _IOCFB_IOCFB10_MASK                      0x00000400
#define _IOCFB_IOCFB10_LENGTH                    0x00000001

#define _IOCFB_IOCFB11_POSITION                  0x0000000B
#define _IOCFB_IOCFB11_MASK                      0x00000800
#define _IOCFB_IOCFB11_LENGTH                    0x00000001

