MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA606/mcu.h
#define _CNPUE_IOCPE4_POSITION                   0x00000004
#define _CNPUE_IOCPE4_MASK                       0x00000010
#define _CNPUE_IOCPE4_LENGTH                     0x00000001

#define _CNPUE_IOCPE5_POSITION                   0x00000005
#define _CNPUE_IOCPE5_MASK                       0x00000020
#define _CNPUE_IOCPE5_LENGTH                     0x00000001

#define _CNPUE_IOCPE6_POSITION                   0x00000006
#define _CNPUE_IOCPE6_MASK                       0x00000040
#define _CNPUE_IOCPE6_LENGTH                     0x00000001

#define _CNPUE_IOCPE7_POSITION                   0x00000007
#define _CNPUE_IOCPE7_MASK                       0x00000080
#define _CNPUE_IOCPE7_LENGTH                     0x00000001

#define _CNPUE_IOCPUE0_POSITION                  0x00000000
#define _CNPUE_IOCPUE0_MASK                      0x00000001
#define _CNPUE_IOCPUE0_LENGTH                    0x00000001

#define _CNPUE_IOCPUE1_POSITION                  0x00000001
#define _CNPUE_IOCPUE1_MASK                      0x00000002
#define _CNPUE_IOCPUE1_LENGTH                    0x00000001

#define _CNPUE_IOCPUE2_POSITION                  0x00000002
#define _CNPUE_IOCPUE2_MASK                      0x00000004
#define _CNPUE_IOCPUE2_LENGTH                    0x00000001

#define _CNPUE_IOCPUE3_POSITION                  0x00000003
#define _CNPUE_IOCPUE3_MASK                      0x00000008
#define _CNPUE_IOCPUE3_LENGTH                    0x00000001

#define _CNPUE_IOCPUE4_POSITION                  0x00000004
#define _CNPUE_IOCPUE4_MASK                      0x00000010
#define _CNPUE_IOCPUE4_LENGTH                    0x00000001

#define _CNPUE_IOCPUE5_POSITION                  0x00000005
#define _CNPUE_IOCPUE5_MASK                      0x00000020
#define _CNPUE_IOCPUE5_LENGTH                    0x00000001

#define _CNPUE_IOCPUE6_POSITION                  0x00000006
#define _CNPUE_IOCPUE6_MASK                      0x00000040
#define _CNPUE_IOCPUE6_LENGTH                    0x00000001

#define _CNPUE_IOCPUE7_POSITION                  0x00000007
#define _CNPUE_IOCPUE7_MASK                      0x00000080
#define _CNPUE_IOCPUE7_LENGTH                    0x00000001

#define _CNPUE_CNPUE0_POSITION                   0x00000000
#define _CNPUE_CNPUE0_MASK                       0x00000001
#define _CNPUE_CNPUE0_LENGTH                     0x00000001

#define _CNPUE_CNPUE1_POSITION                   0x00000001
#define _CNPUE_CNPUE1_MASK                       0x00000002
#define _CNPUE_CNPUE1_LENGTH                     0x00000001

#define _CNPUE_CNPUE2_POSITION                   0x00000002
#define _CNPUE_CNPUE2_MASK                       0x00000004
#define _CNPUE_CNPUE2_LENGTH                     0x00000001

#define _CNPUE_CNPUE3_POSITION                   0x00000003
#define _CNPUE_CNPUE3_MASK                       0x00000008
#define _CNPUE_CNPUE3_LENGTH                     0x00000001

#define _CNPUE_CNPUE4_POSITION                   0x00000004
#define _CNPUE_CNPUE4_MASK                       0x00000010
#define _CNPUE_CNPUE4_LENGTH                     0x00000001

#define _CNPUE_CNPUE5_POSITION                   0x00000005
#define _CNPUE_CNPUE5_MASK                       0x00000020
#define _CNPUE_CNPUE5_LENGTH                     0x00000001

#define _CNPUE_CNPUE6_POSITION                   0x00000006
#define _CNPUE_CNPUE6_MASK                       0x00000040
#define _CNPUE_CNPUE6_LENGTH                     0x00000001

#define _CNPUE_CNPUE7_POSITION                   0x00000007
#define _CNPUE_CNPUE7_MASK                       0x00000080
#define _CNPUE_CNPUE7_LENGTH                     0x00000001

#define _IOCPUE_IOCPE0_POSITION                  0x00000000
#define _IOCPUE_IOCPE0_MASK                      0x00000001
#define _IOCPUE_IOCPE0_LENGTH                    0x00000001

#define _IOCPUE_IOCPE1_POSITION                  0x00000001
#define _IOCPUE_IOCPE1_MASK                      0x00000002
#define _IOCPUE_IOCPE1_LENGTH                    0x00000001

#define _IOCPUE_IOCPE2_POSITION                  0x00000002
#define _IOCPUE_IOCPE2_MASK                      0x00000004
#define _IOCPUE_IOCPE2_LENGTH                    0x00000001

#define _IOCPUE_IOCPE3_POSITION                  0x00000003
#define _IOCPUE_IOCPE3_MASK                      0x00000008
#define _IOCPUE_IOCPE3_LENGTH                    0x00000001

#define _IOCPUE_IOCPE4_POSITION                  0x00000004
#define _IOCPUE_IOCPE4_MASK                      0x00000010
#define _IOCPUE_IOCPE4_LENGTH                    0x00000001

#define _IOCPUE_IOCPE5_POSITION                  0x00000005
#define _IOCPUE_IOCPE5_MASK                      0x00000020
#define _IOCPUE_IOCPE5_LENGTH                    0x00000001

#define _IOCPUE_IOCPE6_POSITION                  0x00000006
#define _IOCPUE_IOCPE6_MASK                      0x00000040
#define _IOCPUE_IOCPE6_LENGTH                    0x00000001

#define _IOCPUE_IOCPE7_POSITION                  0x00000007
#define _IOCPUE_IOCPE7_MASK                      0x00000080
#define _IOCPUE_IOCPE7_LENGTH                    0x00000001

#define _IOCPUE_IOCPUE0_POSITION                 0x00000000
#define _IOCPUE_IOCPUE0_MASK                     0x00000001
#define _IOCPUE_IOCPUE0_LENGTH                   0x00000001

#define _IOCPUE_IOCPUE1_POSITION                 0x00000001
#define _IOCPUE_IOCPUE1_MASK                     0x00000002
#define _IOCPUE_IOCPUE1_LENGTH                   0x00000001

#define _IOCPUE_IOCPUE2_POSITION                 0x00000002
#define _IOCPUE_IOCPUE2_MASK                     0x00000004
#define _IOCPUE_IOCPUE2_LENGTH                   0x00000001

#define _IOCPUE_IOCPUE3_POSITION                 0x00000003
#define _IOCPUE_IOCPUE3_MASK                     0x00000008
#define _IOCPUE_IOCPUE3_LENGTH                   0x00000001

#define _IOCPUE_IOCPUE4_POSITION                 0x00000004
#define _IOCPUE_IOCPUE4_MASK                     0x00000010
#define _IOCPUE_IOCPUE4_LENGTH                   0x00000001

#define _IOCPUE_IOCPUE5_POSITION                 0x00000005
#define _IOCPUE_IOCPUE5_MASK                     0x00000020
#define _IOCPUE_IOCPUE5_LENGTH                   0x00000001

#define _IOCPUE_IOCPUE6_POSITION                 0x00000006
#define _IOCPUE_IOCPUE6_MASK                     0x00000040
#define _IOCPUE_IOCPUE6_LENGTH                   0x00000001

#define _IOCPUE_IOCPUE7_POSITION                 0x00000007
#define _IOCPUE_IOCPUE7_MASK                     0x00000080
#define _IOCPUE_IOCPUE7_LENGTH                   0x00000001

#define _IOCPUE_CNPUE0_POSITION                  0x00000000
#define _IOCPUE_CNPUE0_MASK                      0x00000001
#define _IOCPUE_CNPUE0_LENGTH                    0x00000001

#define _IOCPUE_CNPUE1_POSITION                  0x00000001
#define _IOCPUE_CNPUE1_MASK                      0x00000002
#define _IOCPUE_CNPUE1_LENGTH                    0x00000001

