MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA606/mcu.h
#define _CNPDG_IOCPDG6_POSITION                  0x00000006
#define _CNPDG_IOCPDG6_MASK                      0x00000040
#define _CNPDG_IOCPDG6_LENGTH                    0x00000001

#define _CNPDG_IOCPDG7_POSITION                  0x00000007
#define _CNPDG_IOCPDG7_MASK                      0x00000080
#define _CNPDG_IOCPDG7_LENGTH                    0x00000001

#define _CNPDG_IOCPDG8_POSITION                  0x00000008
#define _CNPDG_IOCPDG8_MASK                      0x00000100
#define _CNPDG_IOCPDG8_LENGTH                    0x00000001

#define _CNPDG_IOCPDG9_POSITION                  0x00000009
#define _CNPDG_IOCPDG9_MASK                      0x00000200
#define _CNPDG_IOCPDG9_LENGTH                    0x00000001

#define _CNPDG_CNPDG2_POSITION                   0x00000002
#define _CNPDG_CNPDG2_MASK                       0x00000004
#define _CNPDG_CNPDG2_LENGTH                     0x00000001

#define _CNPDG_CNPDG3_POSITION                   0x00000003
#define _CNPDG_CNPDG3_MASK                       0x00000008
#define _CNPDG_CNPDG3_LENGTH                     0x00000001

#define _CNPDG_CNPDG6_POSITION                   0x00000006
#define _CNPDG_CNPDG6_MASK                       0x00000040
#define _CNPDG_CNPDG6_LENGTH                     0x00000001

#define _CNPDG_CNPDG7_POSITION                   0x00000007
#define _CNPDG_CNPDG7_MASK                       0x00000080
#define _CNPDG_CNPDG7_LENGTH                     0x00000001

#define _CNPDG_CNPDG8_POSITION                   0x00000008
#define _CNPDG_CNPDG8_MASK                       0x00000100
#define _CNPDG_CNPDG8_LENGTH                     0x00000001

#define _CNPDG_CNPDG9_POSITION                   0x00000009
#define _CNPDG_CNPDG9_MASK                       0x00000200
#define _CNPDG_CNPDG9_LENGTH                     0x00000001

#define _IOCPDG_IOCPDG2_POSITION                 0x00000002
#define _IOCPDG_IOCPDG2_MASK                     0x00000004
#define _IOCPDG_IOCPDG2_LENGTH                   0x00000001

#define _IOCPDG_IOCPDG3_POSITION                 0x00000003
#define _IOCPDG_IOCPDG3_MASK                     0x00000008
#define _IOCPDG_IOCPDG3_LENGTH                   0x00000001

#define _IOCPDG_IOCPDG6_POSITION                 0x00000006
#define _IOCPDG_IOCPDG6_MASK                     0x00000040
#define _IOCPDG_IOCPDG6_LENGTH                   0x00000001

#define _IOCPDG_IOCPDG7_POSITION                 0x00000007
#define _IOCPDG_IOCPDG7_MASK                     0x00000080
#define _IOCPDG_IOCPDG7_LENGTH                   0x00000001

#define _IOCPDG_IOCPDG8_POSITION                 0x00000008
#define _IOCPDG_IOCPDG8_MASK                     0x00000100
#define _IOCPDG_IOCPDG8_LENGTH                   0x00000001

#define _IOCPDG_IOCPDG9_POSITION                 0x00000009
#define _IOCPDG_IOCPDG9_MASK                     0x00000200
#define _IOCPDG_IOCPDG9_LENGTH                   0x00000001

#define _IOCPDG_CNPDG2_POSITION                  0x00000002
#define _IOCPDG_CNPDG2_MASK                      0x00000004
#define _IOCPDG_CNPDG2_LENGTH                    0x00000001

#define _IOCPDG_CNPDG3_POSITION                  0x00000003
#define _IOCPDG_CNPDG3_MASK                      0x00000008
#define _IOCPDG_CNPDG3_LENGTH                    0x00000001

#define _IOCPDG_CNPDG6_POSITION                  0x00000006
#define _IOCPDG_CNPDG6_MASK                      0x00000040
#define _IOCPDG_CNPDG6_LENGTH                    0x00000001

#define _IOCPDG_CNPDG7_POSITION                  0x00000007
#define _IOCPDG_CNPDG7_MASK                      0x00000080
#define _IOCPDG_CNPDG7_LENGTH                    0x00000001

#define _IOCPDG_CNPDG8_POSITION                  0x00000008
#define _IOCPDG_CNPDG8_MASK                      0x00000100
#define _IOCPDG_CNPDG8_LENGTH                    0x00000001

#define _IOCPDG_CNPDG9_POSITION                  0x00000009
#define _IOCPDG_CNPDG9_MASK                      0x00000200
#define _IOCPDG_CNPDG9_LENGTH                    0x00000001

#define _AD1CON1_DONE_POSITION                   0x00000000
#define _AD1CON1_DONE_MASK                       0x00000001
#define _AD1CON1_DONE_LENGTH                     0x00000001

#define _AD1CON1_SAMP_POSITION                   0x00000001
#define _AD1CON1_SAMP_MASK                       0x00000002
#define _AD1CON1_SAMP_LENGTH                     0x00000001

#define _AD1CON1_ASAM_POSITION                   0x00000002
#define _AD1CON1_ASAM_MASK                       0x00000004
#define _AD1CON1_ASAM_LENGTH                     0x00000001

#define _AD1CON1_SSRC_POSITION                   0x00000004
#define _AD1CON1_SSRC_MASK                       0x000000F0
#define _AD1CON1_SSRC_LENGTH                     0x00000004

#define _AD1CON1_FORM_POSITION                   0x00000008
#define _AD1CON1_FORM_MASK                       0x00000300
#define _AD1CON1_FORM_LENGTH                     0x00000002

#define _AD1CON1_MODE12_POSITION                 0x0000000A
#define _AD1CON1_MODE12_MASK                     0x00000400
#define _AD1CON1_MODE12_LENGTH                   0x00000001

#define _AD1CON1_DMAEN_POSITION                  0x0000000B
#define _AD1CON1_DMAEN_MASK                      0x00000800
#define _AD1CON1_DMAEN_LENGTH                    0x00000001

#define _AD1CON1_DMABM_POSITION                  0x0000000C
#define _AD1CON1_DMABM_MASK                      0x00001000
#define _AD1CON1_DMABM_LENGTH                    0x00000001

#define _AD1CON1_ADSIDL_POSITION                 0x0000000D
#define _AD1CON1_ADSIDL_MASK                     0x00002000
#define _AD1CON1_ADSIDL_LENGTH                   0x00000001

#define _AD1CON1_ADON_POSITION                   0x0000000F
#define _AD1CON1_ADON_MASK                       0x00008000
#define _AD1CON1_ADON_LENGTH                     0x00000001

#define _AD1CON1_SSRC0_POSITION                  0x00000004
#define _AD1CON1_SSRC0_MASK                      0x00000010
#define _AD1CON1_SSRC0_LENGTH                    0x00000001

#define _AD1CON1_SSRC1_POSITION                  0x00000005
#define _AD1CON1_SSRC1_MASK                      0x00000020
#define _AD1CON1_SSRC1_LENGTH                    0x00000001

