MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA606/mcu.h
/*
 * Single panel memory sizes
 */

#ifndef __DUAL_PARTITION
#define __AIVT_BASE 0x0
#define __AIVT_LENGTH 0x100

#define __RESET_BASE 0x0
#define __RESET_LENGTH 0x4

#define __IVT_BASE 0x4
#define __IVT_LENGTH 0xfc

#define __PROGRAM_BASE 0x100
#define __PROGRAM_LENGTH 0x2ae00

#define __FSEC_BASE 0x2af00
#define __FSEC_LENGTH 0x2

#define __FBSLIM_BASE 0x2af10
#define __FBSLIM_LENGTH 0x2

#define __FSIGN_BASE 0x2af14
#define __FSIGN_LENGTH 0x2

#define __FOSCSEL_BASE 0x2af18
#define __FOSCSEL_LENGTH 0x2

#define __FOSC_BASE 0x2af1c
#define __FOSC_LENGTH 0x2

#define __FWDT_BASE 0x2af20
#define __FWDT_LENGTH 0x2

#define __FPOR_BASE 0x2af24
#define __FPOR_LENGTH 0x2

#define __FICD_BASE 0x2af28
#define __FICD_LENGTH 0x2

#define __FDEVOPT1_BASE 0x2af2c
#define __FDEVOPT1_LENGTH 0x2

#endif

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x7800

#define __EDS_BASE 0x8000
#define __EDS_LENGTH 0x800


/*
 * Dual panel memory sizes
 */

#ifdef __DUAL_PARTITION
#define __AIVT_BASE 0x0
#define __AIVT_LENGTH 0x100

#define __RESET_BASE 0x0
#define __RESET_LENGTH 0x4

#define __IVT_BASE 0x4
#define __IVT_LENGTH 0xfc

#define __PROGRAM_BASE 0x100
#define __PROGRAM_LENGTH 0x15600

#define __FSEC_BASE 0x15700
#define __FSEC_LENGTH 0x2

#define __FBSLIM_BASE 0x15710
#define __FBSLIM_LENGTH 0x2

#define __FSIGN_BASE 0x15714
#define __FSIGN_LENGTH 0x2

#define __FOSCSEL_BASE 0x15718
#define __FOSCSEL_LENGTH 0x2

#define __FOSC_BASE 0x1571c
#define __FOSC_LENGTH 0x2

#define __FWDT_BASE 0x15720
#define __FWDT_LENGTH 0x2

#define __FPOR_BASE 0x15724
#define __FPOR_LENGTH 0x2

#define __FICD_BASE 0x15728
#define __FICD_LENGTH 0x2

#define __FDEVOPT1_BASE 0x1572c
#define __FDEVOPT1_LENGTH 0x2

#define __FBTSEQ_BASE 0x157fc
#define __FBTSEQ_LENGTH 0x2

#endif

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x7800

#define __EDS_BASE 0x8000
#define __EDS_LENGTH 0x800


/*
 * PPS Remapping Pin Names
 */

#define _RPOUT_C1OUT 1
#define _RPOUT_C2OUT 2
#define _RPOUT_U1TX 3
#define _RPOUT_U1RTS 4
#define _RPOUT_U2TX 5
#define _RPOUT_U2RTS 6
#define _RPOUT_SDO1 7
#define _RPOUT_SCK1OUT 8
#define _RPOUT_SS1OUT 9
#define _RPOUT_SDO2 10
#define _RPOUT_SCK2OUT 11
#define _RPOUT_SS2OUT 12
#define _RPOUT_OC1 13
#define _RPOUT_OC2 14
#define _RPOUT_OC3 15
#define _RPOUT_OCM4 16
#define _RPOUT_OCM5 17
#define _RPOUT_OCM6 18
#define _RPOUT_U3TX 19
#define _RPOUT_U3RTS 20
#define _RPOUT_U4TX 21
#define _RPOUT_U4RTS 22
#define _RPOUT_SDO3 23
#define _RPOUT_SCK3OUT 24
#define _RPOUT_SS3OUT 25
#define _RPOUT_C3OUT 26
#define _RPOUT_OCM7 27
#define _RPOUT_REFO 28
#define _RPOUT_CLC1OUT 29
#define _RPOUT_CLC2OUT 30
#define _RPOUT_RTCC 31

#endif
